Repository: walid-hammouti/portfolio
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Home
ar: الرئيسية
fr: Accueil

source: Blogs
ar: المدونات

source: About Me
ar: معلومات عني
fr: À propos

source: Contact Me
ar: تواصل معي
fr: Contactez-moi

source: Walid
ar: وليد

source: Hammouti
ar: حموتي

source: Mobile App Developer
ar: مطور تطبيقات هاتف
fr: Développeur d'applications mobiles

# mobileAppDeveloperDesc
source: I am a mobile app developer with one year of experience in developing high-quality Flutter and Dart applications. I enjoy creating innovative, user-friendly apps that solve real problems for users.
ar: أنا مطور تطبيقات جوال لدي خبرة لمدة عام في تطوير تطبيقات فلاتر ودارت عالية الجودة. أستمتع بإنشاء تطبيقات مبتكرة وسهلة الاستخدام تحل مشاكل حقيقية للمستخدمين
fr: Je suis un développeur d'applications mobiles avec un an d'expérience dans le développement d'applications Flutter et Dart de haute qualité. J'aime créer des applications innovantes et conviviales qui résolvent de vrais problèmes pour les utilisateurs.

source: Reach Me
ar: تواصل معي
fr: Contactez-moi

source: Hammouti Walid
ar: حموتي وليد

source: Tech Stack
ar: المهارات التقنية
fr: Stack technique

# techStackDesc
source: Here are some of the technologies and tools I have experience with:
ar: فيما يلي بعض التقنيات والأدوات التي لدي خبرة بها:
fr: Voici quelques-unes des technologies et outils avec lesquels j'ai de l'expérience :

source: Powered by Flutter
ar: مدعوم من Flutter
fr: Propulsé par Flutter

source: Projects
ar: المشاريع
fr: Projets

# aboutmeTitle
source: Hammouti Walid, App & ML Developer
ar: حموتي وليد، مطور تطبيقات وML
fr: Hammouti Walid, Développeur d'applications et de ML

# aboutmeDesc
source: Hi, I’m Hammouti Walid, a passionate app developer and AI enthusiast from Algeria. I love building smart, user-friendly applications that combine beautiful Flutter interfaces with the power of machine learning. I’m currently exploring how AI can enhance real-world apps — from intelligent systems to automation tools. My goal is to create digital products that make life easier, smarter, and more connected.
ar: مرحبًا، أنا حموتي وليد، مطور تطبيقات شغوف ومتحمس للذكاء الاصطناعي من الجزائر. أحب بناء تطبيقات ذكية وسهلة الاستخدام تجمع بين واجهات Flutter الجميلة وقوة التعلم الآلي. أنا أستكشف حاليًا كيف يمكن للذكاء الاصطناعي تحسين التطبيقات في العالم الحقيقي - من الأنظمة الذكية إلى أدوات الأتمتة. هدفي هو إنشاء منتجات رقمية تجعل الحياة أسهل وأكثر ذكاءً وترابطًا.
fr: Bonjour, je suis Hammouti Walid, un développeur d'applications passionné et un enthousiaste de l'IA d'Algérie. J'aime créer des applications intelligentes et conviviales qui combinent de belles interfaces Flutter avec la puissance de l'apprentissage automatique. Je explore actuellement comment l'IA peut améliorer les applications du monde réel - des systèmes intelligents aux outils d'automatisation. Mon objectif est de créer des produits numériques qui rendent la vie plus facile, plus intelligente et plus connectée.

# welcometext
source: Welcome to my portfolio!
ar: مرحبًا بكم في محفظتي!
fr: Bienvenue dans mon portfolio !

# herotitle
source: Hello, I'm
ar: السلام عليكم، أنا
fr: Bonjour, je suis

# experince
source: Experience & Skills
ar: الخبرة والمهارات
fr: Expérience et compétences

# experincedesc
source: A look at my experience across different development fields — from mobile to AI.
ar: نظرة على خبرتي عبر مجالات تطوير مختلفة - من الهاتف إلى الذكاء الاصطناعي.
fr: Un aperçu de mon expérience dans différents domaines de développement - du mobile à l'IA.

source: Mobile Development
ar: تطوير تطبيقات الهاتف
fr: Développement Mobile

# mobileDevText1
source: Built cross-platform mobile apps using Flutter and Dart
ar: بناء تطبيقات هاتف متعددة المنصات باستخدام Flutter و Dart
fr: Développé des applications mobiles multiplateformes utilisant Flutter et Dart

# mobileDevText2
source: Integrated Supabase for authentication and real-time database
ar: دمج Supabase للمصادقة وقاعدة البيانات في الوقت الفعلي
fr: Intégré Supabase pour l'authentification et la base de données en temps réel

# mobileDevText3
source: Designed responsive light and dark themes for better UX
ar: تصميم سمات فاتحة وداكنة متجاوبة لتحسين تجربة المستخدم
fr: Conçu des thèmes clairs et sombres responsives pour une meilleure expérience utilisateur

# mobileDevText4
source: Used Cubit, BLoC, Provider, and Riverpod for scalable state management
ar: استخدمت Cubit و BLoC و Provider و Riverpod لإدارة الحالة القابلة للتطوير
fr: Utilisé Cubit, BLoC, Provider et Riverpod pour la gestion d'état évolutive

source: AI & Machine Learning
ar: الذكاء الاصطناعي وتعلم الآلة
fr: IA & Apprentissage Automatique

# aiText1
source: Currently learning and exploring machine learning techniques
ar: أتعلم حاليًا وأستكشف تقنيات تعلم الآلة
fr: Actuellement en apprentissage et exploration des techniques d'apprentissage automatique

# aiText2
source: Performing data analysis and preprocessing using pandas and NumPy
ar: إجراء تحليل البيانات والمعالجة المسبقة باستخدام pandas و NumPy
fr: Réalisation d'analyse de données et prétraitement utilisant pandas et NumPy

# aiText3
source: Visualizing datasets and model performance with Matplotlib
ar: تصور مجموعات البيانات وأداء النماذج باستخدام Matplotlib
fr: Visualisation des jeux de données et performances des modèles avec Matplotlib

source: Desktop Development
ar: تطوير تطبيقات سطح المكتب
fr: Développement Desktop

# desktopText1
source: Built a Student Management System using C and GTK3
ar: بناء نظام إدارة الطلاب باستخدام C و GTK3
fr: Construit un système de gestion d'étudiants utilisant C et GTK3

# desktopText2
source: Developed a Linear Algebra Calculator with Python and Tkinter
ar: تطوير آلة حاسبة للجبر الخطي باستخدام Python و Tkinter
fr: Développé une calculatrice d'algèbre linéaire avec Python et Tkinter

# copyright
source: © 2025 HAMMOUTI Walid. All rights reserved.
ar: © 2025 حموتي وليد. جميع الحقوق محفوظة.
fr: © 2025 HAMMOUTI Walid. Tous droits réservés.

source: Reach
ar: تواصل
fr: Contactez

source: Me
ar: معي
fr: -moi

# contactDescription
source: Feel free to reach out! You can contact me via email, phone, or through my social media channels. I'd love to hear from you.
ar: لا تتردد في التواصل! يمكنك الاتصال بي عبر البريد الإلكتروني أو الهاتف أو من خلال قنوات التواصل الاجتماعي الخاصة بي. يسعدني أن أسمع منك.
fr: N'hésitez pas à me contacter ! Vous pouvez me joindre par e-mail, téléphone ou via mes réseaux sociaux. J'aimerais avoir de vos nouvelles.

# contactLets
source: Let's
ar: دعونا
fr: Parlons

# contactTalk
source: Talk
ar: نتحدث
fr: ensemble

# contactSubtitle
source: Got something to say? Drop an anonymous message and let's keep it between us 👀
ar: هل لديك شيء لتقوله؟ اترك رسالة مجهولة ولنحتفظ بالأمر بيننا 👀
fr: Quelque chose à dire ? Laissez un message anonyme et gardons ça entre nous 👀

# contactYourName
source: Your Name
ar: اسمك
fr: Votre nom

# contactNameValidation
source: Please enter your name
ar: الرجاء إدخال اسمك
fr: Veuillez entrer votre nom

# contactYourMessage
source: Your Message
ar: رسالتك
fr: Votre message

# contactMessageValidation
source: Please enter your message
ar: الرجاء إدخال رسالتك
fr: Veuillez entrer votre message

# contactMessageHint
source: Write your message here...
ar: اكتب رسالتك هنا...
fr: Écrivez votre message ici...

# contactSendButton
source: Send Message
ar: إرسال الرسالة
fr: Envoyer le message

# contactSuccess
source: Message sent successfully!
ar: تم إرسال الرسالة بنجاح!
fr: Message envoyé avec succès !

# contactError
source: Failed to send email. Please try again.
ar: فشل في إرسال البريد الإلكتروني. الرجاء المحاولة مرة أخرى.
fr: Échec de l'envoi de l'email. Veuillez réessayer.

# whatIBuilt
source: What I’ve Built
ar: ما الذي أنشأته
fr: Ce que j’ai construit

# projectsSubtitle
source: A glimpse into my journey — building meaningful projects that solve problems and inspire ideas.
ar: نظرة على رحلتي — بناء مشاريع هادفة تحل المشكلات وتلهم الأفكار.
fr: Un aperçu de mon parcours — créer des projets significatifs qui résolvent des problèmes et inspirent des idées.

# projectRiguelniTitle
source: Riguelni - Freelance platform
ar: Riguelni - منصة العمل الحر
fr: Riguelni - Plateforme de freelance

# projectRiguelniDesc
source: RIGELNI is a modern freelance marketplace that connects skilled professionals with clients looking for services. The platform provides a secure and intuitive environment where users can both buy and sell services, making it a flexible solution for freelancers and businesses alike. With robust features such as real-time chat and an easy-to-use dashboard, RIGELNI aims to streamline freelance transactions and project management.
ar: ريغيلني هي منصة حديثة للعمل الحر تربط بين المحترفين المهرة والعملاء الباحثين عن خدمات. توفر بيئة آمنة وسهلة الاستخدام حيث يمكن للمستخدمين شراء وبيع الخدمات، مما يجعلها حلاً مرنًا للمستقلين والشركات على حد سواء. مع ميزات قوية مثل الدردشة الفورية ولوحة التحكم البسيطة، تهدف ريغيلني إلى تسهيل المعاملات وإدارة المشاريع.
fr: RIGELNI est une plateforme moderne de freelance qui connecte des professionnels qualifiés avec des clients à la recherche de services. Elle offre un environnement sécurisé et intuitif où les utilisateurs peuvent acheter et vendre des services, rendant la solution flexible pour les freelances et les entreprises. Avec des fonctionnalités telles que le chat en temps réel et un tableau de bord simple, RIGELNI vise à simplifier les transactions et la gestion de projets freelances.

# projectFluentNowTitle
source: FluentNow — Your Smart Language School Companion
ar: FluentNow — رفيقك الذكي لتعلم اللغات
fr: FluentNow — Votre compagnon intelligent d’école de langues

# projectFluentNowDesc
source: FluentNow is a modern mobile app designed for private language schools to connect with their students. It allows users to easily explore available language courses, discover new programs, and stay informed about discounts, upcoming events, and school news. Students can register for courses directly through the app and access detailed information about each program — all in one simple, elegant platform.
ar: FluentNow هو تطبيق حديث صُمم للمدارس الخاصة لتعليم اللغات لربطها بطلابها. يسمح للمستخدمين باستكشاف الدورات المتاحة، واكتشاف البرامج الجديدة، والبقاء على اطلاع بالعروض والأحداث والأخبار. يمكن للطلاب التسجيل مباشرة عبر التطبيق والوصول إلى جميع المعلومات بسهولة وأناقة.
fr: FluentNow est une application mobile moderne conçue pour les écoles de langues privées afin de se connecter avec leurs étudiants. Elle permet d’explorer facilement les cours disponibles, découvrir de nouveaux programmes et rester informé des réductions, événements et actualités. Les étudiants peuvent s’inscrire directement via l’application et accéder à toutes les informations nécessaires — sur une plateforme simple et élégante.

# projectPortfolioTitle
source: My Flutter Web Portfolio
ar: ملفي الشخصي على الويب باستخدام Flutter
fr: Mon portfolio Flutter Web

# projectPortfolioDesc
source: A modern and dynamic portfolio showcasing my projects, skills, and creative journey in software development. From intuitive Flutter interfaces to responsive web solutions, this portfolio reflects my passion for building smart, user-centered technologies. Explore my featured works, learn about my experience, and see how I turn ideas into impactful digital products.
ar: ملف شخصي حديث وديناميكي يعرض مشاريعي ومهاراتي ورحلتي الإبداعية في تطوير البرمجيات. من واجهات Flutter البديهية إلى الحلول الويب المتجاوبة، يعكس هذا الملف شغفي ببناء تقنيات ذكية تركز على المستخدم. استكشف أعمالي وتعرف على خبرتي وكيف أحول الأفكار إلى منتجات رقمية مؤثرة.
fr: Un portfolio moderne et dynamique mettant en valeur mes projets, mes compétences et mon parcours créatif en développement logiciel. Des interfaces intuitives Flutter aux solutions web réactives, ce portfolio reflète ma passion pour la création de technologies centrées sur l’utilisateur. Découvrez mes réalisations et voyez comment je transforme des idées en produits numériques percutants.
